Q1. List any five functions of the pandas library with execution.

**ANSWER**:---

1)'pd.read_csv()': This function is used to read a CSV file into a DataFrame.

2)'df.head()': This function is used to return the first n rows of a DataFrame.

3)'df.describe()': This function generates descriptive statistics that summarize the central tendency, dispersion, and shape of a datasetâ€™s distribution.

4)'df.loc[]': This function is used to access a group of rows and columns by labels or a boolean array.

5)'df.tail()': function in pandas is used to return the last n rows of a DataFrame. By default, df.tail() returns the last 5 rows.

In [1]:
import pandas as pd

# Example 1: Read a CSV file into a DataFrame

csv_data = """
name,age,city
Alice,30,New York
Bob,25,Los Angeles
Charlie,35,Chicago
David,,San Francisco
Eve,29,Houston
"""

with open('sample_data.csv', 'w') as file:
    file.write(csv_data)

df = pd.read_csv('sample_data.csv')
print("DataFrame created using read_csv():")
print(df)

DataFrame created using read_csv():
      name   age           city
0    Alice  30.0       New York
1      Bob  25.0    Los Angeles
2  Charlie  35.0        Chicago
3    David   NaN  San Francisco
4      Eve  29.0        Houston

In [2]:
df[["name","age","city"]]

      name   age           city
0    Alice  30.0       New York
1      Bob  25.0    Los Angeles
2  Charlie  35.0        Chicago
3    David   NaN  San Francisco
4      Eve  29.0        Houston

In [3]:
# Example 2: Display the first few rows of the DataFrame
print("\nFirst 3 rows of the DataFrame using head():")
print(df.head(3))

First 3 rows of the DataFrame using head():
      name   age         city
0    Alice  30.0     New York
1      Bob  25.0  Los Angeles
2  Charlie  35.0      Chicago

In [4]:
df[["name","age","city"]].head(3)

      name   age         city
0    Alice  30.0     New York
1      Bob  25.0  Los Angeles
2  Charlie  35.0      Chicago

In [5]:
# Example 3: Generate descriptive statistics of the DataFrame
print("\nDescriptive statistics using describe():")
print(df.describe())

Descriptive statistics using describe():
             age
count   4.000000
mean   29.750000
std     4.112988
min    25.000000
25%    28.000000
50%    29.500000
75%    31.250000
max    35.000000

In [11]:
# Example 4: Access specific rows and columns using loc[]
print("\nAccessing rows where city is 'Chicago' using loc[]:")
print(df.loc[df['city'] == 'Chicago'])

Accessing rows where city is 'Chicago' using loc[]:
      name   age     city
2  Charlie  35.0  Chicago

In [12]:
df.loc[df['city'] == 'Chicago']

      name   age     city
2  Charlie  35.0  Chicago

In [13]:
#Example 5
print("Last 5 rows of the DataFrame using tail():")
print(df.tail())

Last 5 rows of the DataFrame using tail():
      name   age           city
0    Alice  30.0       New York
1      Bob  25.0    Los Angeles
2  Charlie  35.0        Chicago
3    David   NaN  San Francisco
4      Eve  29.0        Houston

In [15]:
df[["name","age","city"]].tail(5)

      name   age           city
0    Alice  30.0       New York
1      Bob  25.0    Los Angeles
2  Charlie  35.0        Chicago
3    David   NaN  San Francisco
4      Eve  29.0        Houston

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [16]:
def reindex_dataframe(df):

    new_index = range(1, 2 * len(df) + 1, 2)

    df_reindexed = df.copy()
    df_reindexed.index = new_index
    
    return df_reindexed

In [20]:
data = {
    'A': [10, 20, 30, 40, 50],
    'B': [15, 25, 35, 45, 55],
    'C': [20, 30, 40, 50, 60]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

df_reindexed = reindex_dataframe(df)
print("\nRe-indexed DataFrame:")
print(df_reindexed)

Original DataFrame:
    A   B   C
0  10  15  20
1  20  25  30
2  30  35  40
3  40  45  50
4  50  55  60

Re-indexed DataFrame:
    A   B   C
1  10  15  20
3  20  25  30
5  30  35  40
7  40  45  50
9  50  55  60

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [28]:
def sum_first_three_values(df):
    if 'Values' not in df.columns:
        print("DataFrame does not contain a 'Values' column.")
        return
    sum_values = df['Values'][:3].sum()
    print(f"The sum of the first three values is: {sum_values}")

# Example 
data = {
    'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
sum_first_three_values(df)

The sum of the first three values is: 60

In [29]:
data1= {
    'Values': [20, 120, 330, 240, 550]}
df1 = pd.DataFrame(data1)
sum_first_three_values(df1)

The sum of the first three values is: 470

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [23]:
def add_word_count_column(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))
    return df

In [24]:
data = {'Text': [
        'Hello world',
        'This is a test',
        'Pandas is great for data analysis',
        '',
        'One more example']}
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

df_with_word_count = add_word_count_column(df)
print("\nDataFrame with Word_Count column:")
print(df_with_word_count)

Original DataFrame:
                                Text
0                        Hello world
1                     This is a test
2  Pandas is great for data analysis
3
4                   One more example

DataFrame with Word_Count column:
                                Text  Word_Count
0                        Hello world           2
1                     This is a test           4
2  Pandas is great for data analysis           6
3                                              0
4                   One more example           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

Sure, here is a brief explanation:

- **`DataFrame.size`**:
  - **Description**: Total number of elements in the DataFrame.
  - **Output**: A single integer.
  

- **`DataFrame.shape`**:
  - **Description**: Dimensions of the DataFrame.
  - **Output**: A tuple (number of rows, number of columns).
  

In short:
- `df.size` tells you the total count of all elements.
- `df.shape` tells you the structure in terms of rows and columns.

In [26]:
  df.size

10

In [27]:
df.shape

(5, 2)

Q6. Which function of pandas do we use to read an excel file?

**answer**:---

To read an Excel file into a pandas DataFrame, we use the pandas.read_excel() function

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [35]:
df2=pd.DataFrame({"Email":["mustaqeem@gmail.com","siddiqui@gmail.com","krish@gmail.com"]})

In [36]:
df2

                 Email
0  mustaqeem@gmail.com
1   siddiqui@gmail.com
2      krish@gmail.com

In [44]:
def extract_username(email):
    return email.split('@')[0]
df2['Username'] = df2['Email'].apply(extract_username)
print(df2)

                 Email   Username
0  mustaqeem@gmail.com  mustaqeem
1   siddiqui@gmail.com   siddiqui
2      krish@gmail.com      krish

In [46]:
df2[["Email","Username"]]

                 Email   Username
0  mustaqeem@gmail.com  mustaqeem
1   siddiqui@gmail.com   siddiqui
2      krish@gmail.com      krish

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [47]:
def select_rows(df4):
    selected_rows = df4[(df4['A'] > 5) & (df4['B'] < 10)]
    return selected_rows

In [48]:
df4 = pd.DataFrame({'A': [3, 1, 7, 3, 9],
                   'B': [5, 8, 2, 2, 1],
                   'C': [1, 2, 3, 4, 5]})

In [50]:
selected_df = select_rows(df4)
print(selected_df)

   A  B  C
2  7  2  3
4  9  1  5

In [51]:
selected_df[["A","B","C"]]

   A  B  C
2  7  2  3
4  9  1  5

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [57]:
def calculate_statistics(df):
     mean_value = df['Values'].mean()
     median_value = df['Values'].median()
     std_deviation = df['Values'].std()
     return mean_value, median_value, std_deviation

In [58]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

In [59]:
mean, median, std = calculate_statistics(df)
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [60]:

def calculate_moving_average(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values(by='Date')
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df
data = {'Date': ['2024-06-01', '2024-06-02', '2024-06-03', '2024-06-04', '2024-06-05', '2024-06-06', '2024-06-07', '2024-06-08', '2024-06-09', '2024-06-10'],
        'Sales': [100, 110, 120, 130, 140, 150, 160, 170, 180, 190]}
df = pd.DataFrame(data)
df = calculate_moving_average(df)
print(df)

        Date  Sales  MovingAverage
0 2024-06-01    100          100.0
1 2024-06-02    110          105.0
2 2024-06-03    120          110.0
3 2024-06-04    130          115.0
4 2024-06-05    140          120.0
5 2024-06-06    150          125.0
6 2024-06-07    160          130.0
7 2024-06-08    170          140.0
8 2024-06-09    180          150.0
9 2024-06-10    190          160.0

In [62]:
df[[ "Date",  "Sales",  "MovingAverage"]]

        Date  Sales  MovingAverage
0 2024-06-01    100          100.0
1 2024-06-02    110          105.0
2 2024-06-03    120          110.0
3 2024-06-04    130          115.0
4 2024-06-05    140          120.0
5 2024-06-06    150          125.0
6 2024-06-07    160          130.0
7 2024-06-08    170          140.0
8 2024-06-09    180          150.0
9 2024-06-10    190          160.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [65]:

def add_weekday_column(df):
    
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.day_name()
    return df
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)
df = add_weekday_column(df)
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [66]:
df[["Date","Weekday"]]

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [67]:

def select_rows_between_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows
data = {'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-01', '2023-02-15']}
df = pd.DataFrame(data)
selected_df = select_rows_between_dates(df)
print(selected_df)

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-31

In [68]:
selected_df[["Date"]]

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

**ANSWER**:--

To use the basic functions of pandas, we need to import the pandas library itself. 

we can do this using the following import statement:

In [69]:
import pandas as pd